---
title: ElementRecord
classe: Autodesk.Revit.DB.ElementRecord
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 11
---

# ElementRecord

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `elementRecord.IsValidObject` | Boolean |
| `WorksetId WorksetId { get; }` | `elementRecord.WorksetId` | WorksetId |
| `Void Dispose()` | `elementRecord.Dispose()` | Void |
| `Outline GetBoundingBox()` | `elementRecord.GetBoundingBox()` | Outline |
| `ElementId GetCategoryId()` | `elementRecord.GetCategoryId()` | ElementId |
| `ElementId GetDesignOptionId()` | `elementRecord.GetDesignOptionId()` | ElementId |
| `ElementId GetId()` | `elementRecord.GetId()` | ElementId |
| `ElementId GetOwnerViewId()` | `elementRecord.GetOwnerViewId()` | ElementId |
| `Boolean HasBoundingBox()` | `elementRecord.HasBoundingBox()` | Boolean |
| `Boolean IsAnElementType()` | `elementRecord.IsAnElementType()` | Boolean |
| `Boolean IsCurveDriven()` | `elementRecord.IsCurveDriven()` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```